#2. Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
#1 - 1 * 1, 2 - 1 * 2, 3 - 1 * 2 * 3, 4 - 1 * 2 * 3 * 4 и т.д.
#- 4 -> [1, 2, 6, 24]
#- 6 -> [1, 2, 6, 24, 120, 720]
n = int(input("n ="))
fact = [1]
for i in range(1, n+1):
    fact.append(i*fact[i-1])
    i+=1
print(fact)